![png](image_filename.png)

In [13]:
# Standard imports
import pandas as pd
import numpy as np 
# MySQL imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database

In [14]:
# Creating a connection URL for SQLAlchemy
con = "mysql://root:root@localhost:3306/books"
# Creating an engine
engine = create_engine(con)

# Creating a database if it doesn't exist
if not database_exists(engine.url):
    # Creating a database
    create_database(engine.url)
    # Printing a message
    print("Database created.")
# If the database already exists
else:
    # Printing a message
    print("Database already exists.")

Database already exists.

In [15]:
# Importing the authors table
authors = pd.read_csv("Data/authors.csv")
# Viewing the first few rows
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [16]:
# Importing the books table
books = pd.read_csv("Data/books.csv")
# Viewing the first few rows
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [17]:
# Importing the favorites table
favorites = pd.read_csv("Data/favorites.csv")
# Viewing the first few rows
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [18]:
# Importing the users table
users = pd.read_csv("Data/users.csv")
# Viewing the first few rows
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [19]:
# Using the to_sql() method to create tables in the database from Pandas DataFrames
authors.to_sql(name="authors", con=engine, if_exists="replace")
books.to_sql(name="books", con=engine, if_exists="replace")
favorites.to_sql(name="favorites", con=engine, if_exists="replace")
users.to_sql(name="users", con=engine, if_exists="replace")

3

In [21]:
# Testing database 
q = "SHOW TABLES;"
# Reading the query results into a DataFrame
pd.read_sql(q, con)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [28]:
# Checking to see the titles of all of John Doe's favorite books
q = """
SELECT books.title, favorites.user_id 
FROM books
JOIN favorites 
ON books.id = favorites.book_id
WHERE favorites.user_id = 
        (SELECT users.id FROM users WHERE 
        (users.last_name = "Doe" AND users.first_name = "John")
        );
"""
# Reading the query results into a DataFrame
pd.read_sql(q, con)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1